namespace Курсовой_2._0
{
    /// <summary>
    /// банк данных для цветового теста
    /// </summary>
    public static class Colors
    {
        
        public static string color1 { get; set; }
        public static string color2 { get; set; }
        public static string color3 { get; set; }
        public static string color4 { get; set; }
        public static string color5 { get; set; }
        public static string color6 { get; set; }
        public static string color7 { get; set; }
        public static string color8 { get; set; }

        /// <summary>
        /// Формирование результатов по первому цвету
        /// </summary>
        public static string res1()
        {
            string rez = "1";
            if (color1 == "синий")
                rez = "Вам свойственно стремиться к покую и к гармонии с самим собой.";
            else
            {
                if (color1 == "зеленый")
                    rez = "Вы сильны волей, в различных ситуациях вам свойственно играть определенную роль.";
                else
                {
                    if (color1 == "красный")
                        rez = "Вы эмоциональны, готовы принимать участие в любых активностях.";
                    else
                    {
                        if (color1 == "желтый")
                            rez = "Вы обегаете от своих проблем. Стараетесь вообразить свое идеальное будущее.";
                        else
                        {
                            if (color1 == "серый")
                                rez = "Вы отгораживаете себя от лишнего общения, сдерживаете свои эмоции.";
                            else
                            {
                                if (color1 == "фиолетовый")
                                    rez = "Вы очень эмоциональны, часто сочувствуете окружающим, Вам легко внушать что-либо.";
                                else
                                {
                                    if (color1 == "коричневый")
                                        rez = "Вы убегаете от своих проблем, пытаетесь отвлечься от них путем обильного уделения внимания своему физическому здоровью.";
                                    else
                                    {
                                        if (color1 == "черный")
                                            rez = "Вы пытаетесь протестовать против всего, что вас окружает, проявляете негативное, импульсивно-агрессивное поведение.";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по второму цвету
        /// </summary>
        public static string res2()
        {
            string rez = "1";
            if (color2 == "синий")
                rez = "Вы нуждаетесь в приятном общении и удовлетворении со стороны окружающих вас людей.";
            else
            {
                if (color2 == "зеленый")
                    rez = "Вы стремитесь доказать себе какие-либо вещи.";
                else
                {
                    if (color2 == "красный")
                        rez = "Вы эмоциональны, готовы принимать участие в любых активностях.";
                    else
                    {
                        if (color2 == "желтый")
                            rez = "Вы сильно напряжены ожиданием, возможно Вам предстоит встреча с важным для Вас человеком.";
                        else
                        {
                            if (color2 == "серый")
                                rez = "Вы застенчивы, замкнуты в себе, скрываетесь от лишнего внимания, стараетесь изолировать себя от общения.";
                            else
                            {
                                if (color2 == "фиолетовый")
                                    rez = "Вы очень эмоциональны, часто сочувствуете окружающим, Вам легко внушать что-либо.";
                                else
                                {
                                    if (color2 == "коричневый")
                                        rez = "Вы убегаете от своих проблем, пытаетесь отвлечься от них путем обильного уделения внимания своему физическому здоровью.";
                                    else
                                    {
                                        if (color2 == "черный")
                                            rez = "Вы пытаетесь протестовать против всего, что вас окружает, проявляете негативное, импульсивно-агрессивное поведение.";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по третьему цвету
        /// </summary>
        public static string res3()
        {
            string rez = "1";
            if (color3 == "синий")
                rez = "Вы редко испытываете напряжение. Готовы к покою, приятным отношениям и удовлетворению.";
            else
            {
                if (color3 == "зеленый")
                    rez = "Вы пытаетесь определиться в самом себе, достичь самообладания.";
                else
                {
                    if (color3 == "красный")
                        rez = "Вы чем-то сильно раздосадованы или раздражены, что вызывает у Вас эмоциональный застой.";
                    else
                    {
                        if (color3 == "желтый")
                            rez = "Вы легки на контакт с незнакомыми для вас людьми, для вас не составит проблем познакомиться с новым человеком.";
                        else
                        {
                            if (color3 == "серый")
                                rez = "Вы выборочно относитесь с своему кругу общения.";
                            else
                            {
                                if (color3 == "фиолетовый")
                                    rez = "Вы наделены воображением и эмоциональной чувствительностью, хотели бы свободно проявлять эти качества, особенно в обществе столь же чувствительного человека.";
                                else
                                {
                                    if (color3 == "коричневый")
                                        rez = "Вы нуждаетесь в балансе между своим комфортом и физическом здоровьем.";
                                    else
                                    {
                                        if (color3 == "черный")
                                            rez = "Вас не устраивает ситуация, в которой вы находитесь, Вы стараетесь выйти из этой ситуации, уйти от своего партнера (собеседника).";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по четвертому цвету
        /// </summary>
        public static string res4()
        {
            string rez = "1";
            if (color4 == "синий")
                rez = "Вы редко испытываете напряжение. Готовы к покою, приятным отношениям и удовлетворению.";
            else
            {
                if (color4 == "зеленый")
                    rez = "Вы пытаетесь определиться в самом себе, достичь самообладания.";
                else
                {
                    if (color4 == "красный")
                        rez = "Вы чем-то сильно раздосадованы или раздражены, что вызывает у Вас эмоциональный застой.";
                    else
                    {
                        if (color4 == "желтый")
                            rez = "Вы легки на контакт с незнакомыми для вас людьми, для вас не составит проблем познакомиться с новым человеком.";
                        else
                        {
                            if (color4 == "серый")
                                rez = "Вы выборочно относитесь с своему кругу общения.";
                            else
                            {
                                if (color4 == "фиолетовый")
                                    rez = "Вы наделены воображением и эмоциональной чувствительностью, хотели бы свободно проявлять эти качества, особенно в обществе столь же чувствительного человека.";
                                else
                                {
                                    if (color4 == "коричневый")
                                        rez = "Вы нуждаетесь в балансе между своим комфортом и физическом здоровьем.";
                                    else
                                    {
                                        if (color4 == "черный")
                                            rez = "Вас не устраивает ситуация, в которой вы находитесь, Вы стараетесь выйти из этой ситуации, уйти от своего партнера (собеседника).";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по пятому цвету
        /// </summary>
        public static string res5()
        {
            string rez = "1";
            if (color5 == "синий")
                rez = "В связях и отношении с людьми вам свойственно не выделяться, не проявлять эмоции без причины.";
            else
            {
                if (color5 == "зеленый")
                    rez = "Вы пассивно относитесь к социальному порядку, не нуждаетесь в обязательном общении с кем-либо.";
                else
                {
                    if (color5 == "красный")
                        rez = "Вы чем-то раздражены. Вам не нужно лишнее внимание.";
                    else
                    {
                        if (color5 == "желтый")
                            rez = "Вы критически относитесь к выбору своих увлечений или контактов.";
                        else
                        {
                            if (color5 == "серый")
                                rez = "В том, чтобы начать разговор, Вам не составит труда проявить инициативу.";
                            else
                            {
                                if (color5 == "фиолетовый")
                                    rez = "Вы не проявляете свои эмоции на публике, но внутри Вы чувствительны и обидчивы.";
                                else
                                {
                                    if (color5 == "коричневый")
                                        rez = "Ваше физическое здоровье находится в отличном состоянии, и Вы спокой совмещаете между собой все свои обязанности.";
                                    else
                                    {
                                        if (color5 == "черный")
                                            rez = "Вы в состоянии принимать ограничения, идете на компромисс, соглашаетесь с предлагаемыми условиями.";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по шестому цвету
        /// </summary>
        public static string res6()
        {
            string rez = "1";
            if (color6 == "синий")
                rez = "В связях и отношении с людьми вам свойственно не выделяться, не проявлять эмоции без причины.";
            else
            {
                if (color6 == "зеленый")
                    rez = "Вы пассивно относитесь к социальному порядку, не нуждаетесь в обязательном общении с кем-либо.";
                else
                {
                    if (color6 == "красный")
                        rez = "Вы чем-то раздражены. Вам не нужно лишнее внимание.";
                    else
                    {
                        if (color6 == "желтый")
                            rez = "Вы критически относитесь к выбору своих увлечений или контактов.";
                        else
                        {
                            if (color6 == "серый")
                                rez = "Вы заинтересованы в диалоге со своим собеседником. Общение с людьми доставляем вам удовольствие.";
                            else
                            {
                                if (color6 == "фиолетовый")
                                    rez = "Вы не проявляете свои эмоции на публике, но внутри Вы чувствительны и обидчивы.";
                                else
                                {
                                    if (color6 == "коричневый")
                                        rez = "Ваше физическое здоровье находится в отличном состоянии, и Вы спокой совмещаете между собой все свои обязанности.";
                                    else
                                    {
                                        if (color6 == "черный")
                                            rez = "Вы в состоянии принимать ограничения, идете на компромисс, соглашаетесь с предлагаемыми условиями.";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по седьмому цвету
        /// </summary>
        public static string res7()
        {
            string rez = "1";
            if (color7 == "синий")
                rez = "Вы чересчур беспокойны и суетливы, редко проявляете инициативу в общении с людьми.";
            else
            {
                if (color7 == "зеленый")
                    rez = "Вы не любите само-выражаться, подсознательно отказываетесь от признания.";
                else
                {
                    if (color7 == "красный")
                        rez = "Вы чем-то сильно раздражены, ощущаете себя ослабленно, подавленно, беспомощно.";
                    else
                    {
                        if (color7 == "желтый")
                            rez = "Вы сильно обеспокоены ожиданием какого-либо события. Вы помешались на одном событии и не можете переключится какие-либо другие мысли.";
                        else
                        {
                            if (color7 == "серый")
                                rez = "Вы нуждаетесь в общении с людьми, явно проявляете свои эмоции, стремитесь достичь социального успеха.";
                            else
                            {
                                if (color7 == "фиолетовый")
                                    rez = "Вы умеете подавлять свои чувства, контролировать эмоции. Стремитесь к эстетическому, этическому или логическому порядку.";
                                else
                                {
                                    if (color7 == "коричневый")
                                        rez = "Вы подавляете, вытесняете свои физические потребности в пользу каки-либо более важных для Вас дел.";
                                    else
                                    {
                                        if (color7 == "черный")
                                            rez = "Вы не обращаете внимание на помехи и ограничения, игнорируете любые угрозы, в достижении цели Вы весьма предприимчивы.";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }

        /// <summary>
        /// Формирование результатов по восьмому цвету
        /// </summary>
        public static string res8()
        {
            string rez = "1";
            if (color8 == "синий")
                rez = "Вы не заводите «сердечные» связи с людьми. Вы не удовлетворены в отношениях со своим партнером и в своей деятельности.";
            else
            {
                if (color8 == "зеленый")
                    rez = " Ва кажется, что окружающие люди Вас люди оказывают на вас жестокое, бессердечное давление, принуждают Вас делать то, что вам не нравиться.";
                else
                {
                    if (color8 == "красный")
                        rez = "Вас кто-то обидел. Вы с трудом справляетесь со своими делами. Возможно, вы утомлены, из-за чего плохо ориентируетесь в окружающей вас обстановке.";
                    else
                    {
                        if (color8 == "желтый")
                            rez = " Вы сковываете себя в своих талантах.";
                        else
                        {
                            if (color8 == "серый")
                                rez = "Вы нуждаетесь в общении с людьми, явно проявляете свои эмоции, стремитесь достичь социального успеха.";
                            else
                            {
                                if (color8 == "фиолетовый")
                                    rez = "Вы умеете подавлять свои чувства, контролировать эмоции. Стремитесь к эстетическому, этическому или логическому порядку.";
                                else
                                {
                                    if (color8 == "коричневый")
                                        rez = "Вы подавляете, вытесняете свои физические потребности в пользу каки-либо более важных для Вас дел.";
                                    else
                                    {
                                        if (color8 == "черный")
                                            rez = "Вы не обращаете внимание на помехи и ограничения, игнорируете любые угрозы, в достижении цели Вы весьма предприимчивы.";
                                    }
                                }
                            }
                        }
                    }
                }
            }

            return rez;
        }
    }
}
